using System;

namespace HttSoft.MLTERP.Sys
{
    /// <summary>
    /// 功能：客户类型
    /// 作者：陈加海
    /// 日期：2006-11-29
    /// </summary>
    public enum EnumVendorType
    {
        全部 = 0,
        客户 = 1,
        其他加工厂 = 2,
        物流公司 = 3,
        检测机构 = 4,
        快递公司 = 5,
        供应商 = 6,
        染厂 = 7,
        织厂 = 8,
        加工户 = 9,
        工厂 = 10,
        展会客户 = 11,
        展会公司 = 12,
        拉毛厂 = 13,
        内销客户 = 14,
        外销客户 = 15,
        //其他公司 = 16,//辅料供应商
        辅料供应商 = 16,//
    }
}
