using System;
using System.Collections.Generic;
using System.Text;

namespace HttSoft.MLTERP.Sys
{
    public enum ParamSetEnum
    {


        销售合同交期自动延后天数 = 11,
        采购合同交期自动延后天数 = 12,
        未加载数据比对天数=40,

        显示公告 = 60,

        // 基础资料 1-100
        图片数据库连接串 = 90,

        // 业务101-200
        //中文合同条款 = 101,
        //英文合同条款 = 102,

        绑定客户工厂仅显示编码=201,

        销售合同如果状态已经进行到后续流程不允许修改=250,
        采购合同如果状态已经进行到后续流程不允许修改=251,
        发货单如果状态已经进行到后续流程不允许修改=252,




        //生管301-400


        //仓库提交校验库存结算日 = 301,
        仓库单据限制几天以内单据允许修改 = 302,

        //仓库开启库别权限校验 = 303,
        //面料仓库单据验证码单和单据明细数量一致性=304,


        订单数据变更同步到采购单中 = 310,

        //仓库401-500
        染厂是否自动出入库 = 401,
        安全库存预警百分比 = 402,
        留库天数 = 403,

        打印首页件数设定=501,


        产品价格管理历史价格检验天数 = 601,



        扫描查询SQL字段内容 = 800,
        排名查询SQL字段内容 = 801,

    }
    /// <summary>
    /// 提交状态枚举
    /// </summary>
    public enum SubmitFlagEnum
    {
        未提交 = 0,
        已提交 = 1,
    }

}
