using System;

namespace HttSoft.HTERP.Sys
{
    /// <summary>
    /// WHFormList枚举
    /// </summary>
    public enum WHFormList
    {
        /// <summary>
        /// 2012 12 05 整理 zhaixd 后续添加
        /// </summary>
        入库 = 1,
        出库 = 2,
        坯纱入库=3,
        坯纱出库 = 4,
        色纱入库 = 5,
        色纱出库 = 6,
        移库 = 7,
        盘点 = 8,
        期初入库 = 9,    
        形态转换=10,
        坯布入库 = 13,
        坯布出库 = 14,
        面料入库 = 15,
        面料出库 = 16,
        辅料入库 = 17,
        辅料出库 = 18,


        纱线期初入库 = 25,
        色线期初入库 = 26,
        坯布期初入库 = 27,
        面料期初入库 = 28,
        辅料期初入库 = 29,


        坯布盘点=8000,
        坯纱盘点 = 8001,
        色纱盘点 = 8002,
        面料盘点 = 8003,
        辅料盘点 = 8004,

        //大货销售出库=1201,
        //调单销售出库=1203,
        白坯织造入库 = 71,
        销售出库=89,





    }

    /// <summary>
    /// WHFormList枚举
    /// </summary>
    public enum EnumWHType
    {
        面料仓库 = 1,
        坯布仓库=2,
        坯线仓库 = 3,
        色线仓库 = 4,
        辅料仓库=5,
        样品仓库 = 6,
        色卡仓库 = 7,
    }




    ///// <summary>
    ///// WHFormList枚举
    ///// </summary>
    //public enum WH_SpecialType
    //{
    //    采购 = 11,
    //    染色 = 12,
    //    加工 = 13,
    //    织片 = 4,
    //    销售 = 6,
    //    倒筒=9,
    //    生产=10,

    //    样衣生产 = 7,
    //    大货生产 = 8,
    //}

}

