using System;
using System.Collections.Generic;
using System.Text;

namespace HttSoft.HTERP.Sys
{
    public enum FormNoControlEnum
    {
        染布打样通知书 = 91,
        染纱打样通知书 = 90,
        印花打样通知书 = 92,
        送办记录 = 93,
        合同价格修改单=94,
        原料销售合同号=95,

        合同号 = 105,
        面料采购单号 = 106,
        坯布采购单号 = 107,
        坯纱采购单号 = 108,
        色纱采购单号 = 109,
        辅料采购单号 = 104,

        //出入库
        面料入库单号 = 110,
        面料出库单号 = 111,
        移库单号 = 112,
        盘点单号 = 113,
        期初入库单号 = 114,
        纱线入库单号 = 115,
        纱线出库单号 = 116,
        坯布入库单号 = 117,
        坯布出库单号 = 118,
        辅料入库单号 = 119,
        辅料出库单号 = 120,
        码单箱号 = 121,
        开匹单号 = 122,

        //生产 150-200
        染纱加工单号 = 150,
        染布加工单号 = 151,
        印花加工单号 = 152,
        白坯织造加工单号 = 153,
        手织样费用计划单号 = 154,
        手织样执行情况表单号 = 155,
        实际用纱清单号 = 156,
        复合加工单号 = 157,
        客户来样登记表号=158,

        //财务
        对账单号 = 160,
        发票单号 = 161,
        收付款单号 = 162,


        挂板单号 = 201,

        //其他 300-399
        报表流水号 = 300,
        结算单号 = 312,
        报价单号 = 313,
        发货单号 = 314,
        跟单单号 = 315,
        发货单送货单号 = 316,//发货单内的送货单号
        物流单号 = 317,
        快递单号 = 318,
        检验单号 = 319,
        成品检验单号 = 320,
        日报编号 = 321,
        资金计划表编号 = 322,
        日常费用登记单号 = 323,
        样品报价单号 = 324,
        短信输入单号 = 325,
        色卡申请单号 = 326,
        色卡寄样单号 = 327,
        寄样申请单=328,
        包装明细单号 = 329,
        包装单号 = 330,
        


        //人事管理　400-449
        招聘申请单号 = 400,
        应聘登记单号 = 401,
        规章制度单号 = 402,
        请假单号 = 403,
        辞职单号 = 404,

        //出入口相关 450-500
        托运单号 = 450,
        报关发票单号 = 451,
        收汇发票单号 = 452,
        订舱单 =453,


        结算利润结算单号=600,
        结算费用结算单号=601,
        结算考核结算单号=602,


        布匹条码 = 888,
        挂板借出单号 = 9999,
        留样单号 = 9999,
        调样单号 = 9999,

        生产领用=10002,
        外协出库=10003,
        销售出库=10004,
        采购=10005,
        染色=10006,
        生产任务单=10007,
        试样生产单 = 100071,

        调整金额单 = 10008,
    }


    /// <summary>
    /// 客户流水号单据枚举
    /// </summary>
    public enum EnumFNCV
    {
        /// <summary>
        /// 发货单送货单号
        /// </summary>
        发货单送货单号 = 1,
    }
}